
## Plan Result




<pre><code>Plan: 12 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_max_delivery_count
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_max_delivery_count
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Update
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be created
  + resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "create-updates-queue-listen-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.create_updates_queue_max_delivery_count will be created
  + resource "azurerm_key_vault_secret" "create_updates_queue_max_delivery_count" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "create-updates-queue-max-delivery-count"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be created
  + resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "create-updates-queue-send-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be created
  + resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "update-case-queue-listen-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_queue_max_delivery_count will be created
  + resource "azurerm_key_vault_secret" "update_case_queue_max_delivery_count" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "update-case-queue-max-delivery-count"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be created
  + resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat"
      + name                    = "update-case-queue-send-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.create-updates-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "create-updates"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat"
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.KeyVault/vaults/et-aat|et-aat"
        name                       = "et-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.update-case-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "update-case"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-aat/providers/Microsoft.ServiceBus/namespaces/et-aat"
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Vars":{}} -->